sample-payloads/broken--wrong-body-element.xml

<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Header>
    <AuthSOAPHeader xmlns="urn://HeaderNamespace">
      <MoreHeaderElementsHere/>
    </AuthSOAPHeader>
  </soap12:Header>
  <soap12:Body>
    <WrongSoapMethodName xmlns="urn://MethodNamespace">
      <Other ElementsofBODY='foo'/>
    </WrongSoapMethodName>
  </soap12:Body>
</soap12:Envelope>
